Autodesk.Revit.DB.ExternallyTaggedBRep.GetTaggedGeometry(Autodesk.Revit.DB.ExternalGeometryId)
Returns the externally tagged geometry object.
externalId:
An external tag that may match a geometry object (i.e face/edge) in this Solid.
Returns:
Returns the geometry object that matches the external tag.
If no such object is found, this method will return null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ExternallyTaggedBRep
An ExternallyTaggedSolid can hold any shape created by BRepBuilder.
Since:
2022